html/python/pythonic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>优雅的python代码</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="content">
<h1 class="title">优雅的python代码</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">循环</a>
<ul>
<li><a href="#sec-1-1">遍历一个范围内的数字</a></li>
<li><a href="#sec-1-2">遍历一个集合</a></li>
<li><a href="#sec-1-3">反向遍历一个集合</a></li>
<li><a href="#sec-1-4">遍历两个集合</a></li>
<li><a href="#sec-1-5">有序地遍历</a>
<ul>
<li><a href="#sec-1-5-1">自定义排序顺序</a></li>
</ul>
</li>
<li><a href="#sec-1-6">调用一个函数直到遇到标记值</a></li>
<li><a href="#sec-1-7">在循环内识别多个退出点</a></li>
</ul>
</li>
<li><a href="#sec-2">字典</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">循环</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">遍历一个范围内的数字</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> [0, 1, 2, 3, 4, 5]:
    <span style="color: #00ffff;">print</span>(i ** 2)
</pre>
</div>

<p>
更好的代码：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">xrange</span>(6):
    <span style="color: #00ffff;">print</span>(i ** 2)
</pre>
</div>

<ul class="org-ul">
<li>xrange 会返回一个迭代器，用来一次一个值地遍历一个范围。这种方式会比 range 更省内存
</li>
<li>xrange 在 Python 3 中已经改名为 range
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">遍历一个集合</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">colors</span> = [ <span style="color: #ffa07a;">'red'</span>,  <span style="color: #ffa07a;">'green'</span>,  <span style="color: #ffa07a;">'blue'</span>,  <span style="color: #ffa07a;">'yellow'</span> ]

<span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(<span style="color: #b0c4de;">len</span>(colors)):
    <span style="color: #00ffff;">print</span>(colors[i])
</pre>
</div>

<p>
更好的写法：
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">colors</span> = [ <span style="color: #ffa07a;">'red'</span>,  <span style="color: #ffa07a;">'green'</span>,  <span style="color: #ffa07a;">'blue'</span>,  <span style="color: #ffa07a;">'yellow'</span> ]

<span style="color: #00ffff;">for</span> color <span style="color: #00ffff;">in</span> colors:
    <span style="color: #00ffff;">print</span>(color)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">反向遍历一个集合</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">colors</span> = [ <span style="color: #ffa07a;">'red'</span>,  <span style="color: #ffa07a;">'green'</span>,  <span style="color: #ffa07a;">'blue'</span>,  <span style="color: #ffa07a;">'yellow'</span> ]

<span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(<span style="color: #b0c4de;">len</span>(colors) - 1,  -1,  -1):
        <span style="color: #00ffff;">print</span> (colors[i])
</pre>
</div>

<p>
更好的写法：
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">colors</span> = [ <span style="color: #ffa07a;">'red'</span>,  <span style="color: #ffa07a;">'green'</span>,  <span style="color: #ffa07a;">'blue'</span>,  <span style="color: #ffa07a;">'yellow'</span> ]

<span style="color: #00ffff;">for</span>  color <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">reversed</span>(colors):
    <span style="color: #00ffff;">print</span> (color)
</pre>
</div>

<p>
这种写法效率高，优雅，而且帮你省去亲自创建和自增下标。当你发现你在操作集合的下标时，你很有可能在做错事
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">遍历两个集合</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">names</span> = [<span style="color: #ffa07a;">'raymond'</span>, <span style="color: #ffa07a;">'rachel'</span>, <span style="color: #ffa07a;">'matthew'</span>]
<span style="color: #eedd82;">colors</span> = [<span style="color: #ffa07a;">'red'</span>, <span style="color: #ffa07a;">'green'</span>, <span style="color: #ffa07a;">'blue'</span>, <span style="color: #ffa07a;">'yellow'</span>]

<span style="color: #eedd82;">n</span> = <span style="color: #b0c4de;">min</span>(<span style="color: #b0c4de;">len</span>(names), <span style="color: #b0c4de;">len</span>(colors))

<span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(n):
    <span style="color: #00ffff;">print</span> (names[i], <span style="color: #ffa07a;">'-&gt;'</span>, colors[i])
</pre>
</div>

<p>
更好的写法：
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">for</span> name, color <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">zip</span>(names, colors):
    <span style="color: #00ffff;">print</span> (name, <span style="color: #ffa07a;">'-&gt;'</span>, color)
</pre>
</div>

<p>
zip 在内存中生成一个新的列表，需要更多的内存。izip 比 zip 效率更高
</p>

<p>
注意：在 Python 3 中，izip 改名为 zip，并替换了原来的 zip 成为内置函数
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">有序地遍历</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>顺序遍历：

<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">colors</span> = [ <span style="color: #ffa07a;">'red'</span>,  <span style="color: #ffa07a;">'green'</span>,  <span style="color: #ffa07a;">'blue'</span>,  <span style="color: #ffa07a;">'yellow'</span> ]

<span style="color: #00ffff;">for</span> color <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">sorted</span>(colors):
    <span style="color: #00ffff;">print</span> (color)
</pre>
</div>
</li>

<li>倒序遍历：

<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">for</span> color <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">sorted</span>(colors, reverse=<span style="color: #7fffd4;">True</span>):
    <span style="color: #00ffff;">print</span> (color)
</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">自定义排序顺序</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">compare_length</span>(c1, c2):
    <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">len</span>(c1) &lt; <span style="color: #b0c4de;">len</span>(c2):
        <span style="color: #00ffff;">return</span> -1
    <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">len</span>(c1) &gt; <span style="color: #b0c4de;">len</span>(c2):
        <span style="color: #00ffff;">return</span> 1
    <span style="color: #00ffff;">return</span> 0

<span style="color: #00ffff;">for</span> color <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">sorted</span>(colors, <span style="color: #b0c4de;">cmp</span>=compare_length):
    <span style="color: #00ffff;">print</span> (color)
</pre>
</div>

<p>
更好的写法：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">print</span> (<span style="color: #b0c4de;">sorted</span>(colors, key=<span style="color: #b0c4de;">len</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">调用一个函数直到遇到标记值</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">blocks</span> = []

<span style="color: #00ffff;">while</span> <span style="color: #7fffd4;">True</span>:
    <span style="color: #eedd82;">block</span> = f.read(32)
    <span style="color: #00ffff;">if</span> block == <span style="color: #ffa07a;">''</span>:
        <span style="color: #00ffff;">break</span>
    blocks.append(block)
</pre>
</div>

<p>
更好的写法：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">blocks</span> = []

<span style="color: #00ffff;">for</span> block <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">iter</span>(partial(f.read, 32),  <span style="color: #ffa07a;">''</span>):
    blocks.append(block)
</pre>
</div>

<p>
iter 接受两个参数：第一个是你反复调用的函数，第二个是标记值。第二种写法的优势：
</p>
<ul class="org-ul">
<li>iter 的返回值是个迭代器，迭代器能用在各种地方，set，sorted，min，max，heapq，sum等
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">在循环内识别多个退出点</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #eedd82;">seq</span> = [0, 1, 2, 3, 4, 5, 6]

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">find</span>(seq, target):
    <span style="color: #eedd82;">found</span> = <span style="color: #7fffd4;">False</span>

    <span style="color: #00ffff;">for</span> i, value <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">enumerate</span>(seq):
        <span style="color: #00ffff;">if</span> value == target:
            <span style="color: #eedd82;">found</span> = <span style="color: #7fffd4;">True</span>
            <span style="color: #00ffff;">break</span>

    <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">not</span> found:
        <span style="color: #00ffff;">return</span> -1

    <span style="color: #00ffff;">return</span> i

<span style="color: #00ffff;">print</span> (find(seq, 3)) <span style="color: #ff4500;"># </span><span style="color: #ff4500;">3 </span>
<span style="color: #00ffff;">print</span> (find(seq, 8)) <span style="color: #ff4500;"># </span><span style="color: #ff4500;">-1</span>
</pre>
</div>

<p>
更好的写法，for 执行完所有的循环后就会执行 else：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">find</span>(seq, target):
    <span style="color: #00ffff;">for</span> i, value <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">enumerate</span>(seq):
        <span style="color: #00ffff;">if</span> value == target:
            <span style="color: #00ffff;">break</span>

    <span style="color: #00ffff;">else</span>:
        <span style="color: #00ffff;">return</span> -1

    <span style="color: #00ffff;">return</span> i
</pre>
</div>

<p>
有两种方法去理解 for-else：
</p>
<ul class="org-ul">
<li>传统的方法是把 for 看作 if，当 for 后面的条件为 False 时执行 else。其实条件为 False 时，就是 for 循环没被 break 出去，把所有循环都跑完的时候
</li>
<li>另一种方法就是把 else 记成 nobreak，当 for 没有被 break，那么循环结束时会进入到 else
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">字典</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
